ams/src/Catalogs/AMS_Продукция/AMS_Продукция.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>AMS_Продукция</name>
  <hierarchical>true</hierarchical>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Маркер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокГодности</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТоварныйЗнак</name>
      <type>
        <types>EnumRef.AMS_ТоварныйЗнак</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Прайс</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Подбор</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>В2В</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЧестныйЗнак</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КфцРРЦ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ams/src/Catalogs/AMS_Продукция/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	т.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ СпрВесь
		|ИЗ
		|	Справочник.AMS_Продукция.Товары КАК т
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.AMS_Продукция КАК д
		|		ПО т.Ссылка = д.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СпрВесь.Номенклатура КАК Номенклатура,
		|	КОЛИЧЕСТВО(СпрВесь.Номенклатура) КАК Количество
		|ПОМЕСТИТЬ Повторы
		|ИЗ
		|	СпрВесь КАК СпрВесь
		|СГРУППИРОВАТЬ ПО
		|	СпрВесь.Номенклатура
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(СпрВесь.Номенклатура) > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Повторы.Номенклатура КАК Номенклатура
		|ИЗ
		|	Повторы КАК Повторы
		|		ЛЕВОЕ СОЕДИНЕНИЕ СпрВесь КАК СпрВесь
		|		ПО Повторы.Номенклатура = СпрВесь.Номенклатура";
	
	Рез = Запрос.Выполнить();
	
	Если Не Рез.Пустой() Тогда
		Выб = Рез.Выбрать();
		Выб.Следующий();
		
		ВызватьИсключение "Повторное использование """ + Выб.Номенклатура + """.";
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
